movie/app/controllers/movies_controller.rb

    def liste_film
        @movies = Movie.all
---
SELECT "movies".* FROM "movies"