movie/app/views/movies/liste_film.html.erb

SELECT  "directors".* FROM "directors" WHERE "directors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<% @movies.each do |movie| %>
    <p><%= movie.title %>, réalisé par <%= movie.director.first_name %>, sorti en <%= movie.release_year %></p>