crud/app/controllers/gossips_controller.rb

INSERT INTO "gossips" ("anonymous_author", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["anonymous_author", ""], ["content", ""], ["created_at", "2018-05-02 14:18:31.357521"], ["updated_at", "2018-05-02 14:18:31.357521"]]
INSERT INTO "comments" ("anonymous_commentor", "body", "created_at", "updated_at", "gossip_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["anonymous_commentor", "comment1"], ["body", "commentaire un"], ["created_at", "2018-05-02 09:43:21.534657"], ["updated_at", "2018-05-02 09:43:21.534657"], ["gossip_id", 11]]
---
    def create
        if params["valider"] == "create"
            gossip = Gossip.create(anonymous_author: params["author"], content: params["content"])
            redirect_to gossip_path(gossip.id)
        end
        if  params["valider"] == "comment"
            comment = Comment.create(anonymous_commentor: params["commentateur"], body: params["commentaire"], gossip_id: params["id_gossip"].to_i)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def edit
        @gossip = Gossip.find(params[:id])
        @id = Gossip.find(params[:id]).id
        @nom = Gossip.find(params[:id]).anonymous_author
        @content = Gossip.find(params[:id]).content

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "anonymous_author" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["anonymous_author", "test2"], ["updated_at", "2018-05-02 13:19:15.269214"], ["id", 1]]
---
    def update

        @gossip = Gossip.find(params[:id])
        gossip_params = params.require(:gossip).permit(:anonymous_author, :content)
        @gossip.update(gossip_params)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 1]]
---
    def destroy
        @del = Gossip.find(params[:id])
        @del.destroy